tests/Unit/Request/informrequest.xml

<SOAP-ENV:Envelope
    SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
    <SOAP-ENV:Header>
        <cwmp:ID
            SOAP-ENV:mustUnderstand="1">
            16002
        </cwmp:ID>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <cwmp:Inform>
            <DeviceId>
                <Manufacturer>ECONET</Manufacturer>
                <OUI>F4D9C6</OUI>
                <ProductClass>UM806</ProductClass>
                <SerialNumber>ZNTSA01C5008</SerialNumber>
            </DeviceId>
            <Event
                xsi:type="SOAP-ENC:Array"
                SOAP-ENC:arrayType="cwmp:EventStruct[1]">
                <EventStruct>
                    <EventCode>1 BOOT</EventCode>
                    <CommandKey></CommandKey>
                </EventStruct>
            </Event>
            <MaxEnvelopes>
                1
            </MaxEnvelopes>
            <CurrentTime>
                2021-02-03T16:15:13+01:00
            </CurrentTime>
            <RetryCount>
                0
            </RetryCount>
            <ParameterList
                xsi:type="SOAP-ENC:Array"
                SOAP-ENC:arrayType="cwmp:ParameterValueStruct[8]">
                <ParameterValueStruct>
                    <Name>
                        InternetGatewayDevice.DeviceSummary
                    </Name>
                    <Value
                        xsi:type="xsd:string">InternetGatewayDevice:1.0[](Baseline:1, IPPing:1, WiFiLAN:1)</Value>
                </ParameterValueStruct>
                <ParameterValueStruct>
                    <Name>
                        InternetGatewayDevice.DeviceInfo.SpecVersion
                    </Name>
                    <Value
                        xsi:type="xsd:string">
                        1.0
                    </Value>
                </ParameterValueStruct>
                <ParameterValueStruct>
                    <Name>
                        InternetGatewayDevice.DeviceInfo.HardwareVersion
                    </Name>
                    <Value
                        xsi:type="xsd:string">
                        HV1.0.00
                    </Value>
                </ParameterValueStruct>
                <ParameterValueStruct>
                    <Name>
                        InternetGatewayDevice.DeviceInfo.SoftwareVersion
                    </Name>
                    <Value
                        xsi:type="xsd:string">
                        V1.0.0P210203
                    </Value>
                </ParameterValueStruct>
                <ParameterValueStruct>
                    <Name>
                        InternetGatewayDevice.DeviceInfo.ProvisioningCode
                    </Name>
                    <Value
                        xsi:type="xsd:string">
                    </Value>
                </ParameterValueStruct>
                <ParameterValueStruct>
                    <Name>
                        InternetGatewayDevice.ManagementServer.ConnectionRequestURL
                    </Name>
                    <Value
                        xsi:type="xsd:string">
                        http://10.90.12.3:7547/tr69
                    </Value>
                </ParameterValueStruct>
                <ParameterValueStruct>
                    <Name>
                        InternetGatewayDevice.ManagementServer.ParameterKey
                    </Name>
                    <Value
                        xsi:type="xsd:string">
                    </Value>
                </ParameterValueStruct>
                <ParameterValueStruct>
                    <Name>
                        InternetGatewayDevice.WANDevice.1.WANConnectionDevice.1.WANIPConnection.1.ExternalIPAddress
                    </Name>
                    <Value
                        xsi:type="xsd:string">
                        10.90.12.3
                    </Value>
                </ParameterValueStruct>
            </ParameterList>
        </cwmp:Inform>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
